// Получение координат рисунка
const getObjData = (posX = 0, posY = 0) => {
    // Переменный под каждую часть объекта
    let bottomIn, bottomOut, topIn, topOut, leftIn, leftOut, rightIn, rightOut, centerIn, centerOut;

    // Создание объектов с координатами каждой части рисунка
    bottomIn = [
        {fill: "black", fillStroke: "#a9363e", lineWidth: 2},
        {StartX: "62.4606", StartY: "13.0221", EndX: "63.5517", EndY: "12.6480"},
        {StartX: "63.5517", StartY: "12.6480", EndX: "63.7496", EndY: "12.6255"},
        {StartX: "63.7496", StartY: "12.6255", EndX: "64.6923", EndY: "12.7038"},
        {StartX: "63.8313", StartY: "14.8388", EndX: "62.4606", EndY: "13.0221"},
        {StartX: "64.6923", StartY: "12.7038", EndX: "65.6100", EndY: "12.7866"},
        {StartX: "65.6100", StartY: "12.7866", EndX: "66.3873", EndY: "12.4319"},
        {StartX: "66.3873", StartY: "12.4319", EndX: "79.3834", EndY: "16.6207"},
        {StartX: "73.1414", StartY: "22.9513", EndX: "63.8313", EndY: "14.8388"},
        {StartX: "74.3448", StartY: "24.0062", EndX: "73.1414", EndY: "22.9513"},
        {StartX: "79.3834", StartY: "16.6207", EndX: "83.1326", EndY: "17.3521"},
        {StartX: "81.5082", StartY: "30.3047", EndX: "74.3448", EndY: "24.0062"},
        {StartX: "83.1326", StartY: "17.3521", EndX: "87.4675", EndY: "17.6660"},
        {StartX: "83.4398", StartY: "32.5261", EndX: "81.5082", EndY: "30.3047"},
        {StartX: "87.4675", StartY: "17.6660", EndX: "88.4295", EndY: "18.0432"},
        {StartX: "88.4295", StartY: "18.0432", EndX: "106.3813", EndY: "26.9450"},
        {StartX: "90.4972", StartY: "43.3894", EndX: "83.4398", EndY: "32.5261"},
        {StartX: "91.0940", StartY: "45.0974", EndX: "90.4972", EndY: "43.3894"},
        {StartX: "92.3731", StartY: "52.9506", EndX: "91.0940", EndY: "45.0974"},
        {StartX: "101.7281", StartY: "57.6147", EndX: "92.3731", EndY: "52.9506"},
        {StartX: "102.5099", StartY: "58.4837", EndX: "101.7281", EndY: "57.6147"},
        {StartX: "106.3813", StartY: "26.9450", EndX: "106.9671", EndY: "27.3319"},
        {StartX: "106.9671", StartY: "27.3319", EndX: "114.0270", EndY: "33.5923"},
        {StartX: "107.9282", StartY: "78.7918", EndX: "108.8005", EndY: "72.2118"},
        {StartX: "108.8005", StartY: "72.2118", EndX: "102.5099", EndY: "58.4837"},
        {StartX: "114.0270", StartY: "33.5923", EndX: "118.6377", EndY: "37.6791"},
        {StartX: "117.8632", StartY: "79.6082", EndX: "107.9282", EndY: "78.7918"},
        {StartX: "118.6377", StartY: "37.6791", EndX: "123.2264", EndY: "42.7212"},
        {StartX: "122.3214", StartY: "64.3075", EndX: "117.8632", EndY: "79.6082"},
        {StartX: "123.2264", StartY: "42.7212", EndX: "125.9291", EndY: "46.6206"},
        {StartX: "124.0374", StartY: "59.8271", EndX: "122.3214", EndY: "64.3075"},
        {StartX: "125.9291", StartY: "46.6206", EndX: "126.9847", EndY: "51.5712"},
        {StartX: "126.9847", StartY: "51.5712", EndX: "127.6020", EndY: "55.6072"},
        {StartX: "127.6020", StartY: "55.6072", EndX: "124.0374", EndY: "59.8271"},
    ];

    bottomOut = [
        {fill: "#6E1218", fillStroke: "#a9363e", lineWidth: 2},
        {StartX: "29.2262", StartY: "8.7620", EndX: "34.5444", EndY: "5.9378"},
        {StartX: "33.1325", StartY: "9.2848", EndX: "29.2262", EndY: "8.7620"},
        {StartX: "34.5444", StartY: "5.9378", EndX: "34.9509", EndY: "5.7428"},
        {StartX: "34.9509", StartY: "5.7428", EndX: "36.3690", EndY: "5.2674"},
        {StartX: "36.3690", StartY: "5.2674", EndX: "40.9529", EndY: "3.8349"},
        {StartX: "37.3723", StartY: "10.1106", EndX: "33.1325", EndY: "9.2848"},
        {StartX: "40.9529", StartY: "3.8349", EndX: "47.7297", EndY: "1.9614"},
        {StartX: "41.6621", StartY: "11.4991", EndX: "37.3723", EndY: "10.1106"},
        {StartX: "45.8942", StartY: "13.2330", EndX: "41.6621", EndY: "11.4991"},
        {StartX: "47.7297", StartY: "1.9614", EndX: "52.6687", EndY: "0.8542"},
        {StartX: "49.9239", StartY: "15.2930", EndX: "45.8942", EndY: "13.2330"},
        {StartX: "52.6687", StartY: "0.8542", EndX: "57.6002", EndY: "0.2186"},
        {StartX: "53.9031", StartY: "17.8336", EndX: "49.9239", EndY: "15.2930"},
        {StartX: "57.6002", StartY: "0.2186", EndX: "62.5000", EndY: "0.0000"},
        {StartX: "57.7643", StartY: "20.9000", EndX: "53.9031", EndY: "17.8336"},
        {StartX: "57.8618", StartY: "20.9812", EndX: "57.7643", EndY: "20.9000"},
        {StartX: "62.1941", StartY: "24.8978", EndX: "57.8618", EndY: "20.9812"},
        {StartX: "62.5000", StartY: "0.0000", EndX: "67.0414", EndY: "0.1091"},
        {StartX: "63.3340", StartY: "25.9722", EndX: "62.1941", EndY: "24.8978"},
        {StartX: "66.9649", StartY: "29.5401", EndX: "63.3340", EndY: "25.9722"},
        {StartX: "67.0414", StartY: "0.1091", EndX: "71.7259", EndY: "0.6664"},
        {StartX: "71.7259", StartY: "0.6664", EndX: "76.9388", EndY: "1.8505"},
        {StartX: "71.7588", StartY: "34.7945", EndX: "66.9649", EndY: "29.5401"},
        {StartX: "75.3833", StartY: "39.3914", EndX: "71.7588", EndY: "34.7945"},
        {StartX: "76.9388", StartY: "1.8505", EndX: "77.8186", EndY: "2.0801"},
        {StartX: "77.4625", StartY: "42.5748", EndX: "75.3833", EndY: "39.3914"},
        {StartX: "77.8186", StartY: "2.0801", EndX: "87.5749", EndY: "4.8578"},
        {StartX: "79.3611", StartY: "46.3247", EndX: "77.4625", EndY: "42.5748"},
        {StartX: "80.9027", StartY: "50.2073", EndX: "79.3611", EndY: "46.3247"},
        {StartX: "81.8864", StartY: "53.7441", EndX: "80.9027", EndY: "50.2073"},
        {StartX: "82.2913", StartY: "60.3024", EndX: "82.4505", EndY: "58.7873"},
        {StartX: "82.3834", StartY: "56.6760", EndX: "81.8864", EndY: "53.7441"},
        {StartX: "82.4505", StartY: "58.7873", EndX: "82.3834", EndY: "56.6760"},
        {StartX: "84.3999", StartY: "60.3530", EndX: "82.2913", EndY: "60.3024"},
        {StartX: "87.0049", StartY: "60.7682", EndX: "84.3999", EndY: "60.3530"},
        {StartX: "87.5749", StartY: "4.8578", EndX: "91.4243", EndY: "6.0977"},
        {StartX: "90.0725", StartY: "61.8109", EndX: "87.0049", EndY: "60.7682"},
        {StartX: "91.4243", StartY: "6.0977", EndX: "93.0589", EndY: "6.6823"},
        {StartX: "93.0589", StartY: "6.6823", EndX: "96.5565", EndY: "8.0277"},
        {StartX: "93.2159", StartY: "63.3402", EndX: "90.0725", EndY: "61.8109"},
        {StartX: "95.9498", StartY: "65.1985", EndX: "93.2159", EndY: "63.3402"},
        {StartX: "96.5565", StartY: "8.0277", EndX: "99.5360", EndY: "9.2804"},
        {StartX: "98.0351", StartY: "67.3438", EndX: "95.9498", EndY: "65.1985"},
        {StartX: "98.8179", StartY: "81.0128", EndX: "99.9145", EndY: "80.3692"},
        {StartX: "99.2070", StartY: "69.7337", EndX: "98.0351", EndY: "67.3438"},
        {StartX: "99.5360", StartY: "9.2804", EndX: "104.9006", EndY: "12.0023"},
        {StartX: "99.9093", StartY: "72.5388", EndX: "99.2070", EndY: "69.7337"},
        {StartX: "99.9145", StartY: "80.3692", EndX: "100.3374", EndY: "79.3677"},
        {StartX: "100.1098", StartY: "80.6302", EndX: "98.8179", EndY: "81.0128"},
        {StartX: "100.1717", StartY: "74.3050", EndX: "99.9093", EndY: "72.5388"},
        {StartX: "100.3374", StartY: "79.3677", EndX: "100.3412", EndY: "77.9521"},
        {StartX: "100.3412", StartY: "77.9521", EndX: "100.1717", EndY: "74.3050"},
        {StartX: "101.7699", StartY: "80.2160", EndX: "100.1098", EndY: "80.6302"},
        {StartX: "104.7376", StartY: "79.8829", EndX: "101.7699", EndY: "80.2160"},
        {StartX: "104.9006", StartY: "12.0023", EndX: "105.0323", EndY: "12.0760"},
        {StartX: "105.0323", StartY: "12.0760", EndX: "108.4001", EndY: "14.1611"},
        {StartX: "107.4603", StartY: "79.9639", EndX: "104.7376", EndY: "79.8829"},
        {StartX: "108.4001", StartY: "14.1611", EndX: "109.1103", EndY: "14.6301"},
        {StartX: "109.0884", StartY: "80.1747", EndX: "107.4603", EndY: "79.9639"},
        {StartX: "109.1103", StartY: "14.6301", EndX: "120.1656", EndY: "23.2998"},
        {StartX: "110.6752", StartY: "80.4940", EndX: "109.0884", EndY: "80.1747"},
        {StartX: "110.7049", StartY: "80.5006", EndX: "110.6752", EndY: "80.4940"},
        {StartX: "113.6437", StartY: "81.3990", EndX: "110.7049", EndY: "80.5006"},
        {StartX: "115.1050", StartY: "82.0102", EndX: "113.6437", EndY: "81.3990"},
        {StartX: "116.5379", StartY: "82.7052", EndX: "115.1050", EndY: "82.0102"},
        {StartX: "117.9709", StartY: "83.5539", EndX: "116.5379", EndY: "82.7052"},
        {StartX: "120.1656", StartY: "23.2998", EndX: "121.5100", EndY: "24.4785"},
        {StartX: "120.3368", StartY: "85.3609", EndX: "117.9709", EndY: "83.5539"},
        {StartX: "121.5100", StartY: "24.4785", EndX: "127.3036", EndY: "30.1753"},
        {StartX: "122.1670", StartY: "87.2229", EndX: "120.3368", EndY: "85.3609"},
        {StartX: "123.2158", StartY: "88.4167", EndX: "122.1670", EndY: "87.2229"},
        {StartX: "123.8442", StartY: "89.1883", EndX: "123.2158", EndY: "88.4167"},
        {StartX: "124.3090", StartY: "87.2822", EndX: "123.8442", EndY: "89.1883"},
        {StartX: "127.3036", StartY: "30.1753", EndX: "128.0679", EndY: "31.0749"},
        {StartX: "128.0679", StartY: "31.0749", EndX: "132.0302", EndY: "35.8391"},
        {StartX: "129.0314", StartY: "76.6067", EndX: "124.3090", EndY: "87.2822"},
        {StartX: "129.0389", StartY: "76.5781", EndX: "129.0314", EndY: "76.6067"},
        {StartX: "130.4412", StartY: "71.7406", EndX: "129.0389", EndY: "76.5781"},
        {StartX: "130.4605", StartY: "71.6852", EndX: "130.4412", EndY: "71.7406"},
        {StartX: "131.9674", StartY: "67.4672", EndX: "130.4605", EndY: "71.6852"},
        {StartX: "132.0302", StartY: "35.8391", EndX: "133.0663", EndY: "37.1459"},
        {StartX: "133.0663", StartY: "37.1459", EndX: "137.8352", EndY: "43.4986"},
        {StartX: "134.6465", StartY: "64.0388", EndX: "131.9674", EndY: "67.4672"},
        {StartX: "137.8352", StartY: "43.4986", EndX: "139.1160", EndY: "45.3397"},
        {StartX: "137.9217", StartY: "61.5155", EndX: "134.6465", EndY: "64.0388"},
        {StartX: "139.1160", StartY: "45.3397", EndX: "141.5184", EndY: "49.0489"},
        {StartX: "140.7990", StartY: "61.3773", EndX: "137.9217", EndY: "61.5155"},
        {StartX: "141.5184", StartY: "49.0489", EndX: "141.5869", EndY: "49.1668"},
        {StartX: "141.5869", StartY: "49.1668", EndX: "143.8752", EndY: "53.3812"},
        {StartX: "143.4960", StartY: "62.1354", EndX: "140.7990", EndY: "61.3773"},
        {StartX: "143.6610", StartY: "62.2034", EndX: "143.4960", EndY: "62.1354"},
        {StartX: "143.8752", StartY: "53.3812", EndX: "146.0437", EndY: "58.1670"},
        {StartX: "146.0437", StartY: "58.1670", EndX: "146.3366", EndY: "58.8635"},
        {StartX: "146.0786", StartY: "63.4827", EndX: "143.6610", EndY: "62.2034"},
        {StartX: "146.3366", StartY: "58.8635", EndX: "148.8786", EndY: "65.3580"},
        {StartX: "148.8786", StartY: "65.3580", EndX: "146.0786", EndY: "63.4827"},
    ];

    topIn = [
        {fill: "black", fillStroke: "#a9363e", lineWidth: 2},
        {StartX: "83.8900", StartY: "148.5997", EndX: "87.4545", EndY: "144.3798"},
        {StartX: "84.5072", StartY: "152.6358", EndX: "83.8900", EndY: "148.5997"},
        {StartX: "85.5628", StartY: "157.5864", EndX: "84.5072", EndY: "152.6358"},
        {StartX: "87.4545", StartY: "144.3798", EndX: "89.1705", EndY: "139.8995"},
        {StartX: "88.2656", StartY: "161.4857", EndX: "85.5628", EndY: "157.5864"},
        {StartX: "89.1705", StartY: "139.8995", EndX: "93.6287", EndY: "124.5988"},
        {StartX: "92.8543", StartY: "166.5278", EndX: "88.2656", EndY: "161.4857"},
        {StartX: "93.6287", StartY: "124.5988", EndX: "103.5637", EndY: "125.4151"},
        {StartX: "97.4649", StartY: "170.6146", EndX: "92.8543", EndY: "166.5278"},
        {StartX: "102.6914", StartY: "131.9951", EndX: "108.9820", EndY: "145.7233"},
        {StartX: "103.5637", StartY: "125.4151", EndX: "102.6914", EndY: "131.9951"},
        {StartX: "104.5248", StartY: "176.8750", EndX: "97.4649", EndY: "170.6146"},
        {StartX: "105.1107", StartY: "177.2620", EndX: "104.5248", EndY: "176.8750"},
        {StartX: "108.9820", StartY: "145.7233", EndX: "109.7639", EndY: "146.5923"},
        {StartX: "109.7639", StartY: "146.5923", EndX: "119.1188", EndY: "151.2563"},
        {StartX: "119.1188", StartY: "151.2563", EndX: "120.3980", EndY: "159.1095"},
        {StartX: "120.3980", StartY: "159.1095", EndX: "120.9947", EndY: "160.8175"},
        {StartX: "120.9947", StartY: "160.8175", EndX: "128.0522", EndY: "171.6808"},
        {StartX: "123.0625", StartY: "186.1638", EndX: "105.1107", EndY: "177.2620"},
        {StartX: "124.0244", StartY: "186.5410", EndX: "123.0625", EndY: "186.1638"},
        {StartX: "128.0522", StartY: "171.6808", EndX: "129.9838", EndY: "173.9023"},
        {StartX: "128.3594", StartY: "186.8549", EndX: "124.0244", EndY: "186.5410"},
        {StartX: "129.9838", StartY: "173.9023", EndX: "137.1471", EndY: "180.2007"},
        {StartX: "132.1085", StartY: "187.5862", EndX: "128.3594", EndY: "186.8549"},
        {StartX: "137.1471", StartY: "180.2007", EndX: "138.3506", EndY: "181.2557"},
        {StartX: "138.3506", StartY: "181.2557", EndX: "147.6607", EndY: "189.3681"},
        {StartX: "145.1046", StartY: "191.7750", EndX: "132.1085", EndY: "187.5862"},
        {StartX: "145.8819", StartY: "191.4203", EndX: "145.1046", EndY: "191.7750"},
        {StartX: "146.7996", StartY: "191.5031", EndX: "145.8819", EndY: "191.4203"},
        {StartX: "147.6607", StartY: "189.3681", EndX: "149.0313", EndY: "191.1848"},
        {StartX: "147.7424", StartY: "191.5815", EndX: "146.7996", EndY: "191.5031"},
        {StartX: "147.9402", StartY: "191.5590", EndX: "147.7424", EndY: "191.5815"},
        {StartX: "149.0313", StartY: "191.1848", EndX: "147.9402", EndY: "191.5590"},
    ];

    topOut = [
        {fill: "#6E1218", fillStroke: "#a9363e", lineWidth: 2},
        {StartX: "65.1553", StartY: "145.3434", EndX: "62.6134", EndY: "138.8489"},
        {StartX: "65.4482", StartY: "146.0399", EndX: "65.1553", EndY: "145.3434"},
        {StartX: "62.6134", StartY: "138.8489", EndX: "65.4133", EndY: "140.7243"},
        {StartX: "67.6167", StartY: "150.8257", EndX: "65.4482", EndY: "146.0399"},
        {StartX: "69.9051", StartY: "155.0401", EndX: "67.6167", EndY: "150.8257"},
        {StartX: "65.4133", StartY: "140.7243", EndX: "67.8310", EndY: "142.0036"},
        {StartX: "67.8310", StartY: "142.0036", EndX: "67.9960", EndY: "142.0715"},
        {StartX: "69.9735", StartY: "155.1580", EndX: "69.9051", EndY: "155.0401"},
        {StartX: "72.3760", StartY: "158.8672", EndX: "69.9735", EndY: "155.1580"},
        {StartX: "67.9960", StartY: "142.0715", EndX: "70.6929", EndY: "142.8296"},
        {StartX: "73.6567", StartY: "160.7083", EndX: "72.3760", EndY: "158.8672"},
        {StartX: "70.6929", StartY: "142.8296", EndX: "73.5702", EndY: "142.6914"},
        {StartX: "78.4257", StartY: "167.0610", EndX: "73.6567", EndY: "160.7083"},
        {StartX: "73.5702", StartY: "142.6914", EndX: "76.8455", EndY: "140.1681"},
        {StartX: "79.4618", StartY: "168.3678", EndX: "78.4257", EndY: "167.0610"},
        {StartX: "83.4241", StartY: "173.1320", EndX: "79.4618", EndY: "168.3678"},
        {StartX: "76.8455", StartY: "140.1681", EndX: "79.5246", EndY: "136.7397"},
        {StartX: "79.5246", StartY: "136.7397", EndX: "81.0315", EndY: "132.5218"},
        {StartX: "81.0315", StartY: "132.5218", EndX: "81.0507", EndY: "132.4663"},
        {StartX: "81.0507", StartY: "132.4663", EndX: "82.4531", EndY: "127.6288"},
        {StartX: "82.4531", StartY: "127.6288", EndX: "82.4605", EndY: "127.6002"},
        {StartX: "84.1883", StartY: "174.0316", EndX: "83.4241", EndY: "173.1320"},
        {StartX: "89.9820", StartY: "179.7284", EndX: "84.1883", EndY: "174.0316"},
        {StartX: "82.4605", StartY: "127.6002", EndX: "87.1830", EndY: "116.9247"},
        {StartX: "87.1830", StartY: "116.9247", EndX: "87.6478", EndY: "115.0186"},
        {StartX: "87.6478", StartY: "115.0186", EndX: "88.2761", EndY: "115.7903"},
        {StartX: "88.2761", StartY: "115.7903", EndX: "89.3249", EndY: "116.9840"},
        {StartX: "91.3264", StartY: "180.9071", EndX: "89.9820", EndY: "179.7284"},
        {StartX: "89.3249", StartY: "116.9840", EndX: "91.1551", EndY: "118.8460"},
        {StartX: "102.3816", StartY: "189.5769", EndX: "91.3264", EndY: "180.9071"},
        {StartX: "91.1551", StartY: "118.8460", EndX: "93.5211", EndY: "120.6530"},
        {StartX: "93.5211", StartY: "120.6530", EndX: "94.9541", EndY: "121.5017"},
        {StartX: "94.9541", StartY: "121.5017", EndX: "96.3870", EndY: "122.1968"},
        {StartX: "96.3870", StartY: "122.1968", EndX: "97.8483", EndY: "122.8079"},
        {StartX: "97.8483", StartY: "122.8079", EndX: "100.7870", EndY: "123.7063"},
        {StartX: "100.7870", StartY: "123.7063", EndX: "100.8167", EndY: "123.7129"},
        {StartX: "103.0919", StartY: "190.0459", EndX: "102.3816", EndY: "189.5769"},
        {StartX: "100.8167", StartY: "123.7129", EndX: "102.4035", EndY: "124.0322"},
        {StartX: "106.4596", StartY: "192.1309", EndX: "103.0919", EndY: "190.0459"},
        {StartX: "102.4035", StartY: "124.0322", EndX: "104.0317", EndY: "124.2430"},
        {StartX: "106.5914", StartY: "192.2047", EndX: "106.4596", EndY: "192.1309"},
        {StartX: "111.9560", StartY: "194.9266", EndX: "106.5914", EndY: "192.2047"},
        {StartX: "104.0317", StartY: "124.2430", EndX: "106.7544", EndY: "124.3240"},
        {StartX: "106.7544", StartY: "124.3240", EndX: "109.7221", EndY: "123.9909"},
        {StartX: "111.1546", StartY: "124.8392", EndX: "111.1507", EndY: "126.2548"},
        {StartX: "111.5775", StartY: "123.8377", EndX: "111.1546", EndY: "124.8392"},
        {StartX: "111.1507", StartY: "126.2548", EndX: "111.3203", EndY: "129.9020"},
        {StartX: "109.7221", StartY: "123.9909", EndX: "111.3821", EndY: "123.5767"},
        {StartX: "112.6741", StartY: "123.1941", EndX: "111.5775", EndY: "123.8377"},
        {StartX: "111.3203", StartY: "129.9020", EndX: "111.5826", EndY: "131.6681"},
        {StartX: "114.9355", StartY: "196.1792", EndX: "111.9560", EndY: "194.9266"},
        {StartX: "111.5826", StartY: "131.6681", EndX: "112.2850", EndY: "134.4732"},
        {StartX: "111.3821", StartY: "123.5767", EndX: "112.6741", EndY: "123.1941"},
        {StartX: "112.2850", StartY: "134.4732", EndX: "113.4568", EndY: "136.8631"},
        {StartX: "118.4330", StartY: "197.5246", EndX: "114.9355", EndY: "196.1792"},
        {StartX: "113.4568", StartY: "136.8631", EndX: "115.5422", EndY: "139.0084"},
        {StartX: "115.5422", StartY: "139.0084", EndX: "118.2761", EndY: "140.8667"},
        {StartX: "120.0676", StartY: "198.1093", EndX: "118.4330", EndY: "197.5246"},
        {StartX: "123.9171", StartY: "199.3492", EndX: "120.0676", EndY: "198.1093"},
        {StartX: "118.2761", StartY: "140.8667", EndX: "121.4194", EndY: "142.3960"},
        {StartX: "133.6733", StartY: "202.1269", EndX: "123.9171", EndY: "199.3492"},
        {StartX: "121.4194", StartY: "142.3960", EndX: "124.4870", EndY: "143.4388"},
        {StartX: "124.4870", StartY: "143.4388", EndX: "127.0921", EndY: "143.8540"},
        {StartX: "129.2007", StartY: "143.9046", EndX: "129.0415", EndY: "145.4197"},
        {StartX: "129.0415", StartY: "145.4197", EndX: "129.1085", EndY: "147.5309"},
        {StartX: "127.0921", StartY: "143.8540", EndX: "129.2007", EndY: "143.9046"},
        {StartX: "129.1085", StartY: "147.5309", EndX: "129.6056", EndY: "150.4628"},
        {StartX: "129.6056", StartY: "150.4628", EndX: "130.5892", EndY: "153.9996"},
        {StartX: "130.5892", StartY: "153.9996", EndX: "132.1309", EndY: "157.8822"},
        {StartX: "134.5532", StartY: "202.3565", EndX: "133.6733", EndY: "202.1269"},
        {StartX: "132.1309", StartY: "157.8822", EndX: "134.0295", EndY: "161.6322"},
        {StartX: "139.7661", StartY: "203.5406", EndX: "134.5532", EndY: "202.3565"},
        {StartX: "134.0295", StartY: "161.6322", EndX: "136.1086", EndY: "164.8156"},
        {StartX: "136.1086", StartY: "164.8156", EndX: "139.7331", EndY: "169.4124"},
        {StartX: "144.4505", StartY: "204.0978", EndX: "139.7661", EndY: "203.5406"},
        {StartX: "148.9920", StartY: "204.2069", EndX: "144.4505", EndY: "204.0978"},
        {StartX: "139.7331", StartY: "169.4124", EndX: "144.5271", EndY: "174.6668"},
        {StartX: "144.5271", StartY: "174.6668", EndX: "148.1579", EndY: "178.2348"},
        {StartX: "153.8917", StartY: "203.9883", EndX: "148.9920", EndY: "204.2069"},
        {StartX: "148.1579", StartY: "178.2348", EndX: "149.2978", EndY: "179.3091"},
        {StartX: "149.2978", StartY: "179.3091", EndX: "153.6302", EndY: "183.2258"},
        {StartX: "153.6302", StartY: "183.2258", EndX: "153.7277", EndY: "183.3069"},
        {StartX: "158.8232", StartY: "203.3527", EndX: "153.8917", EndY: "203.9883"},
        {StartX: "153.7277", StartY: "183.3069", EndX: "157.5888", EndY: "186.3733"},
        {StartX: "163.7622", StartY: "202.2455", EndX: "158.8232", EndY: "203.3527"},
        {StartX: "157.5888", StartY: "186.3733", EndX: "161.5680", EndY: "188.9139"},
        {StartX: "170.5391", StartY: "200.3721", EndX: "163.7622", EndY: "202.2455"},
        {StartX: "161.5680", StartY: "188.9139", EndX: "165.5977", EndY: "190.9739"},
        {StartX: "165.5977", StartY: "190.9739", EndX: "169.8298", EndY: "192.7079"},
        {StartX: "175.1230", StartY: "198.9396", EndX: "170.5391", EndY: "200.3721"},
        {StartX: "169.8298", StartY: "192.7079", EndX: "174.1197", EndY: "194.0963"},
        {StartX: "176.5411", StartY: "198.4641", EndX: "175.1230", EndY: "198.9396"},
        {StartX: "176.9476", StartY: "198.2691", EndX: "176.5411", EndY: "198.4641"},
        {StartX: "182.2658", StartY: "195.4449", EndX: "176.9476", EndY: "198.2691"},
        {StartX: "174.1197", StartY: "194.0963", EndX: "178.3595", EndY: "194.9221"},
        {StartX: "178.3595", StartY: "194.9221", EndX: "182.2658", EndY: "195.4449"},
    ];

    leftIn = [
        {fill: "black", fillStroke: "#a9363e", lineWidth: 2},
        {StartX: "16.0877", StartY: "141.4490", EndX: "20.2765", EndY: "128.4529"},
        {StartX: "16.2813", StartY: "144.0868", EndX: "16.3596", EndY: "143.1440"},
        {StartX: "16.3038", StartY: "144.2846", EndX: "16.2813", EndY: "144.0868"},
        {StartX: "16.3596", StartY: "143.1440", EndX: "16.4424", EndY: "142.2263"},
        {StartX: "16.4424", StartY: "142.2263", EndX: "16.0877", EndY: "141.4490"},
        {StartX: "16.6779", StartY: "145.3757", EndX: "16.3038", EndY: "144.2846"},
        {StartX: "18.4946", StartY: "144.0051", EndX: "16.6779", EndY: "145.3757"},
        {StartX: "20.2765", StartY: "128.4529", EndX: "21.0079", EndY: "124.7038"},
        {StartX: "21.0079", StartY: "124.7038", EndX: "21.3218", EndY: "120.3688"},
        {StartX: "21.3218", StartY: "120.3688", EndX: "21.6990", EndY: "119.4069"},
        {StartX: "21.6990", StartY: "119.4069", EndX: "30.6008", EndY: "101.4551"},
        {StartX: "26.6071", StartY: "134.6950", EndX: "18.4946", EndY: "144.0051"},
        {StartX: "27.6620", StartY: "133.4915", EndX: "26.6071", EndY: "134.6950"},
        {StartX: "30.6008", StartY: "101.4551", EndX: "30.9877", EndY: "100.8692"},
        {StartX: "30.9877", StartY: "100.8692", EndX: "37.2481", EndY: "93.8093"},
        {StartX: "33.9605", StartY: "126.3282", EndX: "27.6620", EndY: "133.4915"},
        {StartX: "36.1819", StartY: "124.3966", EndX: "33.9605", EndY: "126.3282"},
        {StartX: "37.2481", StartY: "93.8093", EndX: "41.3350", EndY: "89.1987"},
        {StartX: "41.3350", StartY: "89.1987", EndX: "46.3770", EndY: "84.6100"},
        {StartX: "46.3770", StartY: "84.6100", EndX: "50.2764", EndY: "81.9072"},
        {StartX: "47.0452", StartY: "117.3391", EndX: "36.1819", EndY: "124.3966"},
        {StartX: "48.7532", StartY: "116.7424", EndX: "47.0452", EndY: "117.3391"},
        {StartX: "50.2764", StartY: "81.9072", EndX: "55.2270", EndY: "80.8516"},
        {StartX: "55.2270", StartY: "80.8516", EndX: "59.2630", EndY: "80.2344"},
        {StartX: "56.6064", StartY: "115.4632", EndX: "48.7532", EndY: "116.7424"},
        {StartX: "59.2630", StartY: "80.2344", EndX: "63.4830", EndY: "83.7989"},
        {StartX: "61.2705", StartY: "106.1083", EndX: "56.6064", EndY: "115.4632"},
        {StartX: "62.1395", StartY: "105.3264", EndX: "61.2705", EndY: "106.1083"},
        {StartX: "63.4830", StartY: "83.7989", EndX: "67.9633", EndY: "85.5149"},
        {StartX: "67.9633", StartY: "85.5149", EndX: "83.2640", EndY: "89.9731"},
        {StartX: "75.8676", StartY: "99.0358", EndX: "62.1395", EndY: "105.3264"},
        {StartX: "82.4476", StartY: "99.9081", EndX: "75.8676", EndY: "99.0358"},
        {StartX: "83.2640", StartY: "89.9731", EndX: "82.4476", EndY: "99.9081"},
    ];

    leftOut = [
        {fill: "#6E1218", fillStroke: "#a9363e", lineWidth: 2},
        {StartX: "3.6558", StartY: "145.3364", EndX: "3.7650", EndY: "140.7949"},
        {StartX: "3.7650", StartY: "140.7949", EndX: "4.3222", EndY: "136.1105"},
        {StartX: "3.8745", StartY: "150.2361", EndX: "3.6558", EndY: "145.3364"},
        {StartX: "4.3222", StartY: "136.1105", EndX: "5.5063", EndY: "130.8976"},
        {StartX: "4.5100", StartY: "155.1676", EndX: "3.8745", EndY: "150.2361"},
        {StartX: "5.5063", StartY: "130.8976", EndX: "5.7359", EndY: "130.0177"},
        {StartX: "5.6172", StartY: "160.1066", EndX: "4.5100", EndY: "155.1676"},
        {StartX: "5.7359", StartY: "130.0177", EndX: "8.5136", EndY: "120.2615"},
        {StartX: "7.4907", StartY: "166.8835", EndX: "5.6172", EndY: "160.1066"},
        {StartX: "8.5136", StartY: "120.2615", EndX: "9.7535", EndY: "116.4120"},
        {StartX: "8.9232", StartY: "171.4674", EndX: "7.4907", EndY: "166.8835"},
        {StartX: "9.3986", StartY: "172.8855", EndX: "8.9232", EndY: "171.4674"},
        {StartX: "9.5936", StartY: "173.2920", EndX: "9.3986", EndY: "172.8855"},
        {StartX: "9.7535", StartY: "116.4120", EndX: "10.3381", EndY: "114.7774"},
        {StartX: "10.3381", StartY: "114.7774", EndX: "11.6835", EndY: "111.2799"},
        {StartX: "11.6835", StartY: "111.2799", EndX: "12.9362", EndY: "108.3004"},
        {StartX: "12.4178", StartY: "178.6102", EndX: "9.5936", EndY: "173.2920"},
        {StartX: "12.9362", StartY: "108.3004", EndX: "15.6581", EndY: "102.9358"},
        {StartX: "12.9406", StartY: "174.7039", EndX: "12.4178", EndY: "178.6102"},
        {StartX: "13.7664", StartY: "170.4640", EndX: "12.9406", EndY: "174.7039"},
        {StartX: "15.1549", StartY: "166.1742", EndX: "13.7664", EndY: "170.4640"},
        {StartX: "15.6581", StartY: "102.9358", EndX: "15.7318", EndY: "102.8040"},
        {StartX: "15.7318", StartY: "102.8040", EndX: "17.8169", EndY: "99.4363"},
        {StartX: "16.8888", StartY: "161.9421", EndX: "15.1549", EndY: "166.1742"},
        {StartX: "17.8169", StartY: "99.4363", EndX: "18.2859", EndY: "98.7260"},
        {StartX: "18.2859", StartY: "98.7260", EndX: "26.9556", EndY: "87.6708"},
        {StartX: "18.9488", StartY: "157.9124", EndX: "16.8888", EndY: "161.9421"},
        {StartX: "21.4894", StartY: "153.9332", EndX: "18.9488", EndY: "157.9124"},
        {StartX: "24.5558", StartY: "150.0721", EndX: "21.4894", EndY: "153.9332"},
        {StartX: "24.6370", StartY: "149.9746", EndX: "24.5558", EndY: "150.0721"},
        {StartX: "26.9556", StartY: "87.6708", EndX: "28.1343", EndY: "86.3264"},
        {StartX: "28.1343", StartY: "86.3264", EndX: "33.8311", EndY: "80.5327"},
        {StartX: "28.5537", StartY: "145.6422", EndX: "24.6370", EndY: "149.9746"},
        {StartX: "29.6280", StartY: "144.5023", EndX: "28.5537", EndY: "145.6422"},
        {StartX: "33.1959", StartY: "140.8715", EndX: "29.6280", EndY: "144.5023"},
        {StartX: "33.8311", StartY: "80.5327", EndX: "34.7307", EndY: "79.7685"},
        {StartX: "34.7307", StartY: "79.7685", EndX: "39.4949", EndY: "75.8062"},
        {StartX: "38.4503", StartY: "136.0775", EndX: "33.1959", EndY: "140.8715"},
        {StartX: "39.4949", StartY: "75.8062", EndX: "40.8018", EndY: "74.7701"},
        {StartX: "40.8018", StartY: "74.7701", EndX: "47.1544", EndY: "70.0011"},
        {StartX: "43.0472", StartY: "132.4530", EndX: "38.4503", EndY: "136.0775"},
        {StartX: "46.2306", StartY: "130.3739", EndX: "43.0472", EndY: "132.4530"},
        {StartX: "47.1544", StartY: "70.0011", EndX: "48.9955", EndY: "68.7204"},
        {StartX: "48.9955", StartY: "68.7204", EndX: "52.7047", EndY: "66.3179"},
        {StartX: "49.9805", StartY: "128.4753", EndX: "46.2306", EndY: "130.3739"},
        {StartX: "52.7047", StartY: "66.3179", EndX: "52.8226", EndY: "66.2495"},
        {StartX: "52.8226", StartY: "66.2495", EndX: "57.0370", EndY: "63.9611"},
        {StartX: "53.8631", StartY: "126.9336", EndX: "49.9805", EndY: "128.4753"},
        {StartX: "57.0370", StartY: "63.9611", EndX: "61.8228", EndY: "61.7926"},
        {StartX: "57.3999", StartY: "125.9500", EndX: "53.8631", EndY: "126.9336"},
        {StartX: "60.3318", StartY: "125.4529", EndX: "57.3999", EndY: "125.9500"},
        {StartX: "61.8228", StartY: "61.7926", EndX: "62.5193", EndY: "61.4997"},
        {StartX: "62.4431", StartY: "125.3859", EndX: "60.3318", EndY: "125.4529"},
        {StartX: "62.5193", StartY: "61.4997", EndX: "69.0138", EndY: "58.9578"},
        {StartX: "63.9582", StartY: "125.5451", EndX: "62.4431", EndY: "125.3859"},
        {StartX: "64.0088", StartY: "123.4365", EndX: "63.9582", EndY: "125.5451"},
        {StartX: "64.4240", StartY: "120.8314", EndX: "64.0088", EndY: "123.4365"},
        {StartX: "65.0331", StartY: "67.0373", EndX: "65.1713", EndY: "69.9146"},
        {StartX: "65.1713", StartY: "69.9146", EndX: "67.6946", EndY: "73.1899"},
        {StartX: "65.4668", StartY: "117.7638", EndX: "64.4240", EndY: "120.8314"},
        {StartX: "65.7912", StartY: "64.3404", EndX: "65.0331", EndY: "67.0373"},
        {StartX: "65.8592", StartY: "64.1754", EndX: "65.7912", EndY: "64.3404"},
        {StartX: "66.9960", StartY: "114.6205", EndX: "65.4668", EndY: "117.7638"},
        {StartX: "67.1385", StartY: "61.7577", EndX: "65.8592", EndY: "64.1754"},
        {StartX: "67.6946", StartY: "73.1899", EndX: "71.1231", EndY: "75.8690"},
        {StartX: "68.8543", StartY: "111.8866", EndX: "66.9960", EndY: "114.6205"},
        {StartX: "69.0138", StartY: "58.9578", EndX: "67.1385", EndY: "61.7577"},
        {StartX: "70.9996", StartY: "109.8012", EndX: "68.8543", EndY: "111.8866"},
        {StartX: "71.1231", StartY: "75.8690", EndX: "75.3410", EndY: "77.3759"},
        {StartX: "73.3895", StartY: "108.6294", EndX: "70.9996", EndY: "109.8012"},
        {StartX: "75.3410", StartY: "77.3759", EndX: "75.3964", EndY: "77.3951"},
        {StartX: "75.3964", StartY: "77.3951", EndX: "80.2339", EndY: "78.7975"},
        {StartX: "76.1946", StartY: "107.9270", EndX: "73.3895", EndY: "108.6294"},
        {StartX: "77.9608", StartY: "107.6647", EndX: "76.1946", EndY: "107.9270"},
        {StartX: "80.2339", StartY: "78.7975", EndX: "80.2625", EndY: "78.8049"},
        {StartX: "80.2625", StartY: "78.8049", EndX: "90.9380", EndY: "83.5274"},
        {StartX: "81.6080", StartY: "107.4951", EndX: "77.9608", EndY: "107.6647"},
        {StartX: "83.0235", StartY: "107.4990", EndX: "81.6080", EndY: "107.4951"},
        {StartX: "83.5387", StartY: "103.0988", EndX: "83.8719", EndY: "106.0665"},
        {StartX: "83.6197", StartY: "100.3761", EndX: "83.5387", EndY: "103.0988"},
        {StartX: "83.8305", StartY: "98.7479", EndX: "83.6197", EndY: "100.3761"},
        {StartX: "83.8719", StartY: "106.0665", EndX: "84.2860", EndY: "107.7265"},
        {StartX: "84.0251", StartY: "107.9219", EndX: "83.0235", EndY: "107.4990"},
        {StartX: "84.1498", StartY: "97.1611", EndX: "83.8305", EndY: "98.7479"},
        {StartX: "84.1564", StartY: "97.1314", EndX: "84.1498", EndY: "97.1611"},
        {StartX: "84.2860", StartY: "107.7265", EndX: "84.6686", EndY: "109.0185"},
        {StartX: "84.6686", StartY: "109.0185", EndX: "84.0251", EndY: "107.9219"},
        {StartX: "85.0548", StartY: "94.1927", EndX: "84.1564", EndY: "97.1314"},
        {StartX: "85.6660", StartY: "92.7314", EndX: "85.0548", EndY: "94.1927"},
        {StartX: "86.3610", StartY: "91.2985", EndX: "85.6660", EndY: "92.7314"},
        {StartX: "87.2098", StartY: "89.8655", EndX: "86.3610", EndY: "91.2985"},
        {StartX: "89.0167", StartY: "87.4995", EndX: "87.2098", EndY: "89.8655"},
        {StartX: "90.8787", StartY: "85.6693", EndX: "89.0167", EndY: "87.4995"},
        {StartX: "90.9380", StartY: "83.5274", EndX: "92.8441", EndY: "83.9922"},
        {StartX: "92.0725", StartY: "84.6205", EndX: "90.8787", EndY: "85.6693"},
        {StartX: "92.8441", StartY: "83.9922", EndX: "92.0725", EndY: "84.6205"},
    ];

    rightIn = [
        {fill: "black", fillStroke: "#a9363e", lineWidth: 2},
        {StartX: "128.2673", StartY: "114.2303", EndX: "129.0837", EndY: "104.2953"},
        {StartX: "129.0837", StartY: "104.2953", EndX: "135.6637", EndY: "105.1676"},
        {StartX: "135.6637", StartY: "105.1676", EndX: "149.3918", EndY: "98.8770"},
        {StartX: "143.5680", StartY: "118.6885", EndX: "128.2673", EndY: "114.2303"},
        {StartX: "148.0483", StartY: "120.4045", EndX: "143.5680", EndY: "118.6885"},
        {StartX: "149.3918", StartY: "98.8770", EndX: "150.2608", EndY: "98.0951"},
        {StartX: "150.2608", StartY: "98.0951", EndX: "154.9249", EndY: "88.7402"},
        {StartX: "152.2682", StartY: "123.9690", EndX: "148.0483", EndY: "120.4045"},
        {StartX: "154.9249", StartY: "88.7402", EndX: "162.7781", EndY: "87.4610"},
        {StartX: "156.3043", StartY: "123.3518", EndX: "152.2682", EndY: "123.9690"},
        {StartX: "161.2549", StartY: "122.2962", EndX: "156.3043", EndY: "123.3518"},
        {StartX: "162.7781", StartY: "87.4610", EndX: "164.4861", EndY: "86.8643"},
        {StartX: "164.4861", StartY: "86.8643", EndX: "175.3494", EndY: "79.8068"},
        {StartX: "165.1542", StartY: "119.5934", EndX: "161.2549", EndY: "122.2962"},
        {StartX: "170.1963", StartY: "115.0047", EndX: "165.1542", EndY: "119.5934"},
        {StartX: "174.2832", StartY: "110.3941", EndX: "170.1963", EndY: "115.0047"},
        {StartX: "175.3494", StartY: "79.8068", EndX: "177.5708", EndY: "77.8752"},
        {StartX: "177.5708", StartY: "77.8752", EndX: "183.8692", EndY: "70.7119"},
        {StartX: "180.5436", StartY: "103.3342", EndX: "174.2832", EndY: "110.3941"},
        {StartX: "180.9305", StartY: "102.7483", EndX: "180.5436", EndY: "103.3342"},
        {StartX: "183.8692", StartY: "70.7119", EndX: "184.9242", EndY: "69.5084"},
        {StartX: "184.9242", StartY: "69.5084", EndX: "193.0366", EndY: "60.1983"},
        {StartX: "189.8323", StartY: "84.7965", EndX: "180.9305", EndY: "102.7483"},
        {StartX: "190.2095", StartY: "83.8346", EndX: "189.8323", EndY: "84.7965"},
        {StartX: "190.5234", StartY: "79.4996", EndX: "190.2095", EndY: "83.8346"},
        {StartX: "191.2548", StartY: "75.7505", EndX: "190.5234", EndY: "79.4996"},
        {StartX: "193.0366", StartY: "60.1983", EndX: "194.8534", EndY: "58.8277"},
        {StartX: "194.8534", StartY: "58.8277", EndX: "195.2275", EndY: "59.9188"},
        {StartX: "195.0889", StartY: "61.9771", EndX: "195.4436", EndY: "62.7544"},
        {StartX: "195.1717", StartY: "61.0594", EndX: "195.0889", EndY: "61.9771"},
        {StartX: "195.2275", StartY: "59.9188", EndX: "195.2500", EndY: "60.1166"},
        {StartX: "195.2500", StartY: "60.1166", EndX: "195.1717", EndY: "61.0594"},
        {StartX: "195.4436", StartY: "62.7544", EndX: "191.2548", EndY: "75.7505"},
    ];

    rightOut = [
        {fill: "#6E1218", fillStroke: "#a9363e", lineWidth: 2},
        {StartX: "118.6872", StartY: "120.2112", EndX: "119.4588", EndY: "119.5829"},
        {StartX: "119.4588", StartY: "119.5829", EndX: "120.6525", EndY: "118.5341"},
        {StartX: "120.5932", StartY: "120.6760", EndX: "118.6872", EndY: "120.2112"},
        {StartX: "120.6525", StartY: "118.5341", EndX: "122.5145", EndY: "116.7039"},
        {StartX: "122.5145", StartY: "116.7039", EndX: "124.3215", EndY: "114.3379"},
        {StartX: "124.3215", StartY: "114.3379", EndX: "125.1703", EndY: "112.9049"},
        {StartX: "125.1703", StartY: "112.9049", EndX: "125.8653", EndY: "111.4720"},
        {StartX: "125.8653", StartY: "111.4720", EndX: "126.4765", EndY: "110.0107"},
        {StartX: "126.4765", StartY: "110.0107", EndX: "127.3749", EndY: "107.0720"},
        {StartX: "126.8627", StartY: "95.1849", EndX: "127.5062", EndY: "96.2815"},
        {StartX: "127.2452", StartY: "96.4769", EndX: "126.8627", EndY: "95.1849"},
        {StartX: "127.3749", StartY: "107.0720", EndX: "127.3815", EndY: "107.0423"},
        {StartX: "127.3815", StartY: "107.0423", EndX: "127.7008", EndY: "105.4555"},
        {StartX: "127.5062", StartY: "96.2815", EndX: "128.5078", EndY: "96.7044"},
        {StartX: "127.6594", StartY: "98.1369", EndX: "127.2452", EndY: "96.4769"},
        {StartX: "127.7008", StartY: "105.4555", EndX: "127.9116", EndY: "103.8274"},
        {StartX: "127.9116", StartY: "103.8274", EndX: "127.9925", EndY: "101.1046"},
        {StartX: "127.9925", StartY: "101.1046", EndX: "127.6594", EndY: "98.1369"},
        {StartX: "128.5078", StartY: "96.7044", EndX: "129.9233", EndY: "96.7083"},
        {StartX: "129.9233", StartY: "96.7083", EndX: "133.5705", EndY: "96.5387"},
        {StartX: "131.2687", StartY: "125.3985", EndX: "120.5932", EndY: "120.6760"},
        {StartX: "131.2973", StartY: "125.4059", EndX: "131.2687", EndY: "125.3985"},
        {StartX: "133.5705", StartY: "96.5387", EndX: "135.3366", EndY: "96.2764"},
        {StartX: "135.3366", StartY: "96.2764", EndX: "138.1417", EndY: "95.5740"},
        {StartX: "136.1348", StartY: "126.8083", EndX: "131.2973", EndY: "125.4059"},
        {StartX: "136.1903", StartY: "126.8275", EndX: "136.1348", EndY: "126.8083"},
        {StartX: "138.1417", StartY: "95.5740", EndX: "140.5316", EndY: "94.4022"},
        {StartX: "140.4082", StartY: "128.3344", EndX: "136.1903", EndY: "126.8275"},
        {StartX: "140.5316", StartY: "94.4022", EndX: "142.6769", EndY: "92.3168"},
        {StartX: "142.5175", StartY: "145.2456", EndX: "144.3928", EndY: "142.4457"},
        {StartX: "142.6769", StartY: "92.3168", EndX: "144.5353", EndY: "89.5829"},
        {StartX: "143.8367", StartY: "131.0135", EndX: "140.4082", EndY: "128.3344"},
        {StartX: "144.3928", StartY: "142.4457", EndX: "145.6721", EndY: "140.0280"},
        {StartX: "144.5353", StartY: "89.5829", EndX: "146.0645", EndY: "86.4396"},
        {StartX: "145.6721", StartY: "140.0280", EndX: "145.7401", EndY: "139.8630"},
        {StartX: "145.7401", StartY: "139.8630", EndX: "146.4981", EndY: "137.1661"},
        {StartX: "146.0645", StartY: "86.4396", EndX: "147.1073", EndY: "83.3720"},
        {StartX: "146.3600", StartY: "134.2888", EndX: "143.8367", EndY: "131.0135"},
        {StartX: "146.4981", StartY: "137.1661", EndX: "146.3600", EndY: "134.2888"},
        {StartX: "147.1073", StartY: "83.3720", EndX: "147.5225", EndY: "80.7669"},
        {StartX: "147.5225", StartY: "80.7669", EndX: "147.5731", EndY: "78.6583"},
        {StartX: "147.5731", StartY: "78.6583", EndX: "149.0882", EndY: "78.8175"},
        {StartX: "149.0120", StartY: "142.7037", EndX: "142.5175", EndY: "145.2456"},
        {StartX: "149.0882", StartY: "78.8175", EndX: "151.1995", EndY: "78.7505"},
        {StartX: "149.7084", StartY: "142.4108", EndX: "149.0120", EndY: "142.7037"},
        {StartX: "151.1995", StartY: "78.7505", EndX: "154.1314", EndY: "78.2534"},
        {StartX: "154.1314", StartY: "78.2534", EndX: "157.6682", EndY: "77.2698"},
        {StartX: "154.4942", StartY: "140.2423", EndX: "149.7084", EndY: "142.4108"},
        {StartX: "157.6682", StartY: "77.2698", EndX: "161.5508", EndY: "75.7281"},
        {StartX: "158.7087", StartY: "137.9539", EndX: "154.4942", EndY: "140.2423"},
        {StartX: "158.8266", StartY: "137.8855", EndX: "158.7087", EndY: "137.9539"},
        {StartX: "161.5508", StartY: "75.7281", EndX: "165.3007", EndY: "73.8295"},
        {StartX: "162.5358", StartY: "135.4830", EndX: "158.8266", EndY: "137.8855"},
        {StartX: "164.3769", StartY: "134.2023", EndX: "162.5358", EndY: "135.4830"},
        {StartX: "165.3007", StartY: "73.8295", EndX: "168.4841", EndY: "71.7504"},
        {StartX: "168.4841", StartY: "71.7504", EndX: "173.0810", EndY: "68.1259"},
        {StartX: "170.7295", StartY: "129.4333", EndX: "164.3769", EndY: "134.2023"},
        {StartX: "172.0363", StartY: "128.3972", EndX: "170.7295", EndY: "129.4333"},
        {StartX: "173.0810", StartY: "68.1259", EndX: "178.3353", EndY: "63.3319"},
        {StartX: "176.8006", StartY: "124.4349", EndX: "172.0363", EndY: "128.3972"},
        {StartX: "177.7002", StartY: "123.6707", EndX: "176.8006", EndY: "124.4349"},
        {StartX: "178.3353", StartY: "63.3319", EndX: "181.9033", EndY: "59.7011"},
        {StartX: "181.9033", StartY: "59.7011", EndX: "182.9776", EndY: "58.5612"},
        {StartX: "182.9776", StartY: "58.5612", EndX: "186.8943", EndY: "54.2288"},
        {StartX: "183.3970", StartY: "117.8770", EndX: "177.7002", EndY: "123.6707"},
        {StartX: "184.5757", StartY: "116.5326", EndX: "183.3970", EndY: "117.8770"},
        {StartX: "186.8943", StartY: "54.2288", EndX: "186.9755", EndY: "54.1313"},
        {StartX: "186.9755", StartY: "54.1313", EndX: "190.0419", EndY: "50.2702"},
        {StartX: "190.0419", StartY: "50.2702", EndX: "192.5825", EndY: "46.2910"},
        {StartX: "192.5825", StartY: "46.2910", EndX: "194.6425", EndY: "42.2613"},
        {StartX: "193.2454", StartY: "105.4774", EndX: "184.5757", EndY: "116.5326"},
        {StartX: "193.7144", StartY: "104.7671", EndX: "193.2454", EndY: "105.4774"},
        {StartX: "194.6425", StartY: "42.2613", EndX: "196.3764", EndY: "38.0292"},
        {StartX: "195.7995", StartY: "101.3994", EndX: "193.7144", EndY: "104.7671"},
        {StartX: "195.8732", StartY: "101.2676", EndX: "195.7995", EndY: "101.3994"},
        {StartX: "196.3764", StartY: "38.0292", EndX: "197.7649", EndY: "33.7394"},
        {StartX: "197.7649", StartY: "33.7394", EndX: "198.5906", EndY: "29.4995"},
        {StartX: "198.5906", StartY: "29.4995", EndX: "199.1134", EndY: "25.5932"},
        {StartX: "198.5951", StartY: "95.9030", EndX: "195.8732", EndY: "101.2676"},
        {StartX: "199.1134", StartY: "25.5932", EndX: "201.9377", EndY: "30.9114"},
        {StartX: "199.8477", StartY: "92.9235", EndX: "198.5951", EndY: "95.9030"},
        {StartX: "201.1931", StartY: "89.4260", EndX: "199.8477", EndY: "92.9235"},
        {StartX: "201.7778", StartY: "87.7914", EndX: "201.1931", EndY: "89.4260"},
        {StartX: "201.9377", StartY: "30.9114", EndX: "202.1327", EndY: "31.3179"},
        {StartX: "202.1327", StartY: "31.3179", EndX: "202.6081", EndY: "32.7360"},
        {StartX: "202.6081", StartY: "32.7360", EndX: "204.0406", EndY: "37.3199"},
        {StartX: "203.0177", StartY: "83.9419", EndX: "201.7778", EndY: "87.7914"},
        {StartX: "204.0406", StartY: "37.3199", EndX: "205.9141", EndY: "44.0968"},
        {StartX: "205.7954", StartY: "74.1857", EndX: "203.0177", EndY: "83.9419"},
        {StartX: "205.9141", StartY: "44.0968", EndX: "207.0212", EndY: "49.0358"},
        {StartX: "206.0250", StartY: "73.3058", EndX: "205.7954", EndY: "74.1857"},
        {StartX: "207.0212", StartY: "49.0358", EndX: "207.6568", EndY: "53.9673"},
        {StartX: "207.2091", StartY: "68.0929", EndX: "206.0250", EndY: "73.3058"},
        {StartX: "207.6568", StartY: "53.9673", EndX: "207.8755", EndY: "58.8671"},
        {StartX: "207.7663", StartY: "63.4085", EndX: "207.2091", EndY: "68.0929"},
        {StartX: "207.8755", StartY: "58.8671", EndX: "207.7663", EndY: "63.4085"},
    ];

    centerIn = [
        {fill: "black", fillStroke: "#a9363e", lineWidth: 2},
        {StartX: "100.4518", StartY: "102.4045", EndX: "100.4724", EndY: "101.7144"},
        {StartX: "100.4724", StartY: "101.7144", EndX: "100.5000", EndY: "101.5008"},
        {StartX: "100.5000", StartY: "101.5008", EndX: "100.5443", EndY: "101.2809"},
        {StartX: "100.5263", StartY: "103.0678", EndX: "100.4518", EndY: "102.4045"},
        {StartX: "100.5443", StartY: "101.2809", EndX: "100.9565", EndY: "99.9325"},
        {StartX: "100.5824", StartY: "103.2927", EndX: "100.5263", EndY: "103.0678"},
        {StartX: "100.7010", StartY: "103.6949", EndX: "100.5824", EndY: "103.2927"},
        {StartX: "100.8508", StartY: "104.0991", EndX: "100.7010", EndY: "103.6949"},
        {StartX: "100.9565", StartY: "99.9325", EndX: "101.0626", EndY: "99.6787"},
        {StartX: "101.0626", StartY: "99.6787", EndX: "101.2391", EndY: "99.3150"},
        {StartX: "101.0650", StartY: "104.4982", EndX: "100.8508", EndY: "104.0991"},
        {StartX: "101.2391", StartY: "99.3150", EndX: "101.7080", EndY: "98.7010"},
        {StartX: "101.4595", StartY: "105.2133", EndX: "101.0650", EndY: "104.4982"},
        {StartX: "101.6979", StartY: "105.4846", EndX: "101.4595", EndY: "105.2133"},
        {StartX: "101.7080", StartY: "98.7010", EndX: "102.3781", EndY: "98.0423"},
        {StartX: "102.3566", StartY: "106.1548", EndX: "101.6979", EndY: "105.4846"},
        {StartX: "102.3781", StartY: "98.0423", EndX: "102.7948", EndY: "97.6763"},
        {StartX: "102.7948", StartY: "97.6763", EndX: "102.9855", EndY: "97.5704"},
        {StartX: "102.9706", StartY: "106.6237", EndX: "102.3566", EndY: "106.1548"},
        {StartX: "102.9855", StartY: "97.5704", EndX: "103.9756", EndY: "97.1017"},
        {StartX: "103.3343", StartY: "106.8001", EndX: "102.9706", EndY: "106.6237"},
        {StartX: "103.5881", StartY: "106.9063", EndX: "103.3343", EndY: "106.8001"},
        {StartX: "103.9756", StartY: "97.1017", EndX: "104.0839", EndY: "97.0626"},
        {StartX: "104.0839", StartY: "97.0626", EndX: "104.5478", EndY: "96.9256"},
        {StartX: "104.5478", StartY: "96.9256", EndX: "104.7686", EndY: "96.8705"},
        {StartX: "104.7686", StartY: "96.8705", EndX: "105.4318", EndY: "96.7960"},
        {StartX: "104.9336", StartY: "107.3176", EndX: "103.5881", EndY: "106.9063"},
        {StartX: "105.1595", StartY: "107.3631", EndX: "104.9336", EndY: "107.3176"},
        {StartX: "105.3700", StartY: "107.3904", EndX: "105.1595", EndY: "107.3631"},
        {StartX: "105.4318", StartY: "96.7960", EndX: "106.1220", EndY: "96.8166"},
        {StartX: "106.0602", StartY: "107.4109", EndX: "105.3700", EndY: "107.3904"},
        {StartX: "106.1220", StartY: "96.8166", EndX: "106.3356", EndY: "96.8442"},
        {StartX: "106.3356", StartY: "96.8442", EndX: "106.5555", EndY: "96.8885"},
        {StartX: "106.5555", StartY: "96.8885", EndX: "107.9038", EndY: "97.3007"},
        {StartX: "106.7234", StartY: "107.3364", EndX: "106.0602", EndY: "107.4109"},
        {StartX: "106.9392", StartY: "107.2826", EndX: "106.7234", EndY: "107.3364"},
        {StartX: "107.4840", StartY: "107.1213", EndX: "106.9392", EndY: "107.2826"},
        {StartX: "107.8182", StartY: "107.0043", EndX: "107.4840", EndY: "107.1213"},
        {StartX: "107.9038", StartY: "97.3007", EndX: "108.1577", EndY: "97.4068"},
        {StartX: "108.1465", StartY: "106.8323", EndX: "107.8182", EndY: "107.0043"},
        {StartX: "108.1577", StartY: "97.4068", EndX: "108.5214", EndY: "97.5833"},
        {StartX: "108.5214", StartY: "97.5833", EndX: "109.1354", EndY: "98.0522"},
        {StartX: "108.8284", StartY: "106.4465", EndX: "108.1465", EndY: "106.8323"},
        {StartX: "109.1354", StartY: "98.0522", EndX: "109.7941", EndY: "98.7223"},
        {StartX: "109.1532", StartY: "106.1611", EndX: "108.8284", EndY: "106.4465"},
        {StartX: "109.7941", StartY: "98.7223", EndX: "110.1330", EndY: "99.1081"},
        {StartX: "109.8233", StartY: "105.5024", EndX: "109.1532", EndY: "106.1611"},
        {StartX: "110.1330", StartY: "99.1081", EndX: "110.3849", EndY: "99.5481"},
        {StartX: "110.2922", StartY: "104.8885", EndX: "109.8233", EndY: "105.5024"},
        {StartX: "110.3849", StartY: "99.5481", EndX: "110.7848", EndY: "100.3704"},
        {StartX: "110.4686", StartY: "104.5247", EndX: "110.2922", EndY: "104.8885"},
        {StartX: "110.5748", StartY: "104.2709", EndX: "110.4686", EndY: "104.5247"},
        {StartX: "110.7848", StartY: "100.3704", EndX: "110.7976", EndY: "100.4067"},
        {StartX: "110.7976", StartY: "100.4067", EndX: "110.9545", EndY: "100.9335"},
        {StartX: "110.9545", StartY: "100.9335", EndX: "111.0050", EndY: "101.1356"},
        {StartX: "110.9861", StartY: "102.9255", EndX: "110.5748", EndY: "104.2709"},
        {StartX: "111.0050", StartY: "101.1356", EndX: "111.0802", EndY: "101.8055"},
        {StartX: "111.0337", StartY: "102.6892", EndX: "110.9861", EndY: "102.9255"},
        {StartX: "111.0605", StartY: "102.4845", EndX: "111.0337", EndY: "102.6892"},
        {StartX: "111.0802", StartY: "101.8055", EndX: "111.0605", EndY: "102.4845"},
    ];

    centerOut = [
        {fill: "#6E1218", fillStroke: "#a9363e", lineWidth: 2},
        {StartX: "83.5387", StartY: "103.0988", EndX: "83.6197", EndY: "100.3761"},
        {StartX: "83.6197", StartY: "100.3761", EndX: "83.8305", EndY: "98.7479"},
        {StartX: "83.8305", StartY: "98.7479", EndX: "84.1498", EndY: "97.1611"},
        {StartX: "83.8719", StartY: "106.0665", EndX: "83.5387", EndY: "103.0988"},
        {StartX: "84.1498", StartY: "97.1611", EndX: "84.1564", EndY: "97.1314"},
        {StartX: "84.1564", StartY: "97.1314", EndX: "85.0548", EndY: "94.1927"},
        {StartX: "84.2860", StartY: "107.7265", EndX: "83.8719", EndY: "106.0665"},
        {StartX: "84.6684", StartY: "109.0231", EndX: "84.2860", EndY: "107.7265"},
        {StartX: "85.0548", StartY: "94.1927", EndX: "85.6660", EndY: "92.7314"},
        {StartX: "85.1540", StartY: "110.3333", EndX: "84.6684", EndY: "109.0231"},
        {StartX: "85.5671", StartY: "111.3273", EndX: "85.1540", EndY: "110.3333"},
        {StartX: "85.6660", StartY: "92.7314", EndX: "86.3610", EndY: "91.2985"},
        {StartX: "86.2336", StartY: "112.5692", EndX: "85.5671", EndY: "111.3273"},
        {StartX: "86.3610", StartY: "91.2985", EndX: "87.2098", EndY: "89.8655"},
        {StartX: "87.2098", StartY: "89.8655", EndX: "89.0167", EndY: "87.4995"},
        {StartX: "87.3202", StartY: "114.5389", EndX: "86.2336", EndY: "112.5692"},
        {StartX: "87.6509", StartY: "115.0257", EndX: "87.3202", EndY: "114.5389"},
        {StartX: "88.2761", StartY: "115.7903", EndX: "87.6509", EndY: "115.0257"},
        {StartX: "89.0167", StartY: "87.4995", EndX: "90.8787", EndY: "85.6693"},
        {StartX: "89.3249", StartY: "116.9840", EndX: "88.2761", EndY: "115.7903"},
        {StartX: "90.8787", StartY: "85.6693", EndX: "92.0725", EndY: "84.6205"},
        {StartX: "91.1551", StartY: "118.8460", EndX: "89.3249", EndY: "116.9840"},
        {StartX: "92.0725", StartY: "84.6205", EndX: "92.8044", EndY: "83.9815"},
        {StartX: "92.8044", StartY: "83.9815", EndX: "93.2919", EndY: "83.6393"},
        {StartX: "93.2919", StartY: "83.6393", EndX: "95.2678", EndY: "82.5424"},
        {StartX: "93.5211", StartY: "120.6530", EndX: "91.1551", EndY: "118.8460"},
        {StartX: "94.9541", StartY: "121.5017", EndX: "93.5211", EndY: "120.6530"},
        {StartX: "95.2678", StartY: "82.5424", EndX: "97.4821", EndY: "81.4943"},
        {StartX: "96.3870", StartY: "122.1968", EndX: "94.9541", EndY: "121.5017"},
        {StartX: "97.4821", StartY: "81.4943", EndX: "98.8206", EndY: "81.0111"},
        {StartX: "97.8483", StartY: "122.8079", EndX: "96.3870", EndY: "122.1968"},
        {StartX: "98.8206", StartY: "81.0111", EndX: "100.1098", EndY: "80.6302"},
        {StartX: "100.1098", StartY: "80.6302", EndX: "101.7699", EndY: "80.2160"},
        {StartX: "100.7870", StartY: "123.7063", EndX: "97.8483", EndY: "122.8079"},
        {StartX: "101.7699", StartY: "80.2160", EndX: "104.7376", EndY: "79.8829"},
        {StartX: "102.4035", StartY: "124.0322", EndX: "100.7870", EndY: "123.7063"},
        {StartX: "104.0317", StartY: "124.2430", EndX: "102.4035", EndY: "124.0322"},
        {StartX: "104.7376", StartY: "79.8829", EndX: "107.4603", EndY: "79.9639"},
        {StartX: "106.7544", StartY: "124.3240", EndX: "104.0317", EndY: "124.2430"},
        {StartX: "107.4603", StartY: "79.9639", EndX: "109.0884", EndY: "80.1747"},
        {StartX: "109.0884", StartY: "80.1747", EndX: "110.6752", EndY: "80.4940"},
        {StartX: "109.7221", StartY: "123.9909", EndX: "106.7544", EndY: "124.3240"},
        {StartX: "110.6752", StartY: "80.4940", EndX: "110.7049", EndY: "80.5006"},
        {StartX: "110.7049", StartY: "80.5006", EndX: "113.6437", EndY: "81.3990"},
        {StartX: "111.3821", StartY: "123.5767", EndX: "109.7221", EndY: "123.9909"},
        {StartX: "112.6741", StartY: "123.1941", EndX: "111.3821", EndY: "123.5767"},
        {StartX: "113.6437", StartY: "81.3990", EndX: "115.1050", EndY: "82.0102"},
        {StartX: "113.9950", StartY: "122.7316", EndX: "112.6741", EndY: "123.1941"},
        {StartX: "114.9586", StartY: "122.3252", EndX: "113.9950", EndY: "122.7316"},
        {StartX: "115.1050", StartY: "82.0102", EndX: "116.5379", EndY: "82.7052"},
        {StartX: "116.2234", StartY: "121.6628", EndX: "114.9586", EndY: "122.3252"},
        {StartX: "116.5379", StartY: "82.7052", EndX: "117.9709", EndY: "83.5539"},
        {StartX: "117.9709", StartY: "83.5539", EndX: "120.3368", EndY: "85.3609"},
        {StartX: "118.1715", StartY: "120.5604", EndX: "116.2234", EndY: "121.6628"},
        {StartX: "118.6886", StartY: "120.2112", EndX: "118.1715", EndY: "120.5604"},
        {StartX: "119.4588", StartY: "119.5829", EndX: "118.6886", EndY: "120.2112"},
        {StartX: "120.3368", StartY: "85.3609", EndX: "122.1670", EndY: "87.2229"},
        {StartX: "120.6525", StartY: "118.5341", EndX: "119.4588", EndY: "119.5829"},
        {StartX: "122.1670", StartY: "87.2229", EndX: "123.2158", EndY: "88.4167"},
        {StartX: "122.5145", StartY: "116.7039", EndX: "120.6525", EndY: "118.5341"},
        {StartX: "123.2158", StartY: "88.4167", EndX: "123.8527", EndY: "89.1828"},
        {StartX: "123.8527", StartY: "89.1828", EndX: "124.1958", EndY: "89.6868"},
        {StartX: "124.1958", StartY: "89.6868", EndX: "125.3211", EndY: "91.6530"},
        {StartX: "124.3215", StartY: "114.3379", EndX: "122.5145", EndY: "116.7039"},
        {StartX: "125.1703", StartY: "112.9049", EndX: "124.3215", EndY: "114.3379"},
        {StartX: "125.3211", StartY: "91.6530", EndX: "126.3861", EndY: "93.8427"},
        {StartX: "125.8653", StartY: "111.4720", EndX: "125.1703", EndY: "112.9049"},
        {StartX: "126.3861", StartY: "93.8427", EndX: "126.8584", EndY: "95.1784"},
        {StartX: "126.4765", StartY: "110.0107", EndX: "125.8653", EndY: "111.4720"},
        {StartX: "126.8584", StartY: "95.1784", EndX: "127.2452", EndY: "96.4769"},
        {StartX: "127.2452", StartY: "96.4769", EndX: "127.6594", EndY: "98.1369"},
        {StartX: "127.3749", StartY: "107.0720", EndX: "126.4765", EndY: "110.0107"},
        {StartX: "127.6594", StartY: "98.1369", EndX: "127.9925", EndY: "101.1046"},
        {StartX: "127.7008", StartY: "105.4555", EndX: "127.3749", EndY: "107.0720"},
        {StartX: "127.9137", StartY: "103.8269", EndX: "127.7008", EndY: "105.4555"},
        {StartX: "127.9925", StartY: "101.1046", EndX: "127.9137", EndY: "103.8269"},
    ];

    // Создаем класс объекта
    class Drawing {
        // Принимаем объект со всеми частями рисунка и требуемыми координатами
        constructor(args, posX = 0, posY = 0) {
            // Копируем полученный объект
            this.objects = JSON.parse(JSON.stringify(args));

            // Сохраняем полученные координаты
            this.posX = posX;
            this.posY = posY;

            // Сортируем каждый массив координат для правильной отрисовки
            for (let key in this.objects) {
                this.objects[key] = this.linearSort(this.objects[key]);
            }

            // Конвертируем координаты в числовой тип данных
            this.convertType();

            // Обнуляем координаты
            this.reset(this.objects);

            // Масштабируем по текущему размеру полотна
            this.scaleObj(this.getSize(this.objects).factorScale, this.objects);

            // Центрируем координаты
            this.centering(this.posX, this.posY);
        }

        // Метод сортировки координат
        linearSort(obj) {
            // Создаем переменную для хранения временный значений
            // Заносим туда начальные координаты
            let tempArr = [{...obj[1]}];
            // Сохраняем длину исходного массива
            let objLen = obj.length;
            let count = 0; // Счетчик отсортированных элементов

            // Пока счетчик не будет равен длине исходного массива
            while (count < objLen - 1) {
                // Перебираем массив
                obj.forEach((el) => {
                    // Если элемент массива не имеет свойства "StartX"
                    // Или счетчик больше или равен длине исходного массива
                    // Выходим из функции и всего цикла
                    if (!el.hasOwnProperty("StartX") || count >= objLen - 1) return;

                    // Если конечноя координата последнее элемента во временном массиве
                    // равна начальной координате текущего элемента исходного массива
                    if (tempArr[count].EndX == el.StartX) {
                        tempArr.push(el); // Заносим элемент во временный массив
                        count++; // Инкрементируем счетчик
                    }
                });
            }

            // После всей сортировки
            // добавляем в начало временного массива нулевой элемент исходного массива
            // с информацией о цвете заливки и обводке
            tempArr.unshift(obj[0]);
            return tempArr; // возвращаем временный массив для замены исходного
        }

        // Конвертирование типа координат в целочисленный
        convertType() {
            // Для каждой части объекта
            for (let key in this.objects) {
                // Перебираем массивы координат
                this.objects[key].forEach((el) => {
                    // Если текущий элемент не имеет свойство "StartX"
                    // выходим из функции
                    if (!el.hasOwnProperty("StartX")) return;
                    // Проходимся по каждой координате
                    for (let val in el) {
                        // Заменяем ее на целочисленную копию
                        el[val] = +el[val];
                    }
                });
            }
        }

        // Получение размеров и координат начала и конца рисунка
        getSize(args) {
            // Записываем переданные аргументы в массив
            const objects = args;

            // Текущая ширина и высоты полотна
            const width = document.querySelector("#canvas-2d").width;
            const height = document.querySelector("#canvas-2d").height;

            // Переменные максимальной и минимальной координат по двум осям
            let maxX = 0,
                maxY = 0,
                minX = width,
                minY = height;

            // Перебираем объект
            for (let key in objects) {
                // Перебираем массивы координат объекта
                objects[key].forEach((item) => {
                    // Если имеется свойство "fill" пропускаем элемент
                    if (item.hasOwnProperty("fill")) return;

                    // Сохраняем максимальное и минимальное из заранее сохраненных значения и текущих
                    maxX = Math.max(maxX, item.StartX);
                    maxY = Math.max(maxY, item.StartY);
                    minX = Math.min(minX, item.StartX);
                    minY = Math.min(minY, item.StartY);
                });
            }

            // Получаем процент свободного пространства по оси X
            let factorScale = (minX + (width - maxX)) / width;

            // Если процент по оси Y меньше
            if ((minY + (height - maxY)) / height < factorScale) {
                factorScale = (minY + (height - maxY)) / height; // сохраняем его
            }

            // Добавляем единицу для корректного масштабирования
            factorScale++;

            // Возвращаем объект с координатами начала и конца рисунка, размеры и коэфф. масштабирования
            return {
                minX,
                minY,
                maxX,
                maxY,
                objWidth: maxX - minX,
                objHeight: maxY - minY,
                factorScale,
            };
        }

        // Изменение координат на переданный параметр
        mapPos(obj, factorX = 0, factorY = 0) {
            const tempObj = {};
            for (let key in obj) {
                tempObj[key] = obj[key].map((el, i, arr) => {
                    if (!el.hasOwnProperty("StartX")) return;
                    // Прибавляем к каждой координате значение на которое нужно сместить объект
                    el.StartX += factorX;
                    el.StartY += factorY;
                    el.EndX += factorX;
                    el.EndY += factorY;

                    // Возвращаем измененный элемент массива во временный объект
                    return el;
                });

                // Сохраняем информацию о заливке объекта
                tempObj[key][0] = obj[key][0];
            }

            // Возвращаем объект для перезаписи существующего
            return tempObj;
        }

        // Обнуление координат
        reset(args) {
            const sizes = this.getSize(args);

            // for (let key in args) {
            args = this.mapPos(args, -sizes.minX, -sizes.minY);
            // }
        }

        // Масштабирование объекта
        scaleObj(factor, args) {
            this.reset(args);

            for (let key in args) {
                args[key].forEach((el) => {
                    el.StartX *= factor;
                    el.StartY *= factor;
                });
            }

            return this.getSize(args);
        };

        // Центрирование объекта
        centering(x, y) {
            // Создаем переменные отступа
            let offsetX = x, offsetY = y;
            let sizes = this.getSize(this.objects);

            // Проверяем не вылезает ли за левую и верхнюю границу рисунок
            // Если хотя бы одна координата подходит
            if (x >= sizes.objWidth / 2 || y >= sizes.objHeight / 2) {
                // Проверяем какая координата подошла
                if (y < sizes.objHeight / 2) {
                    offsetX = x - sizes.objWidth / 2;
                    offsetY = 0;
                } else if (x < sizes.objWidth / 2) {
                    offsetX = 0;
                    offsetY = y - sizes.objHeight / 2;
                } else {
                    offsetX = x - sizes.objWidth / 2;
                    offsetY = y - sizes.objHeight / 2;
                }
            }

            // Перемещаем объект по полученным отступам
            this.objects = this.mapPos(this.objects, offsetX, offsetY);
        }
    }

    // Создаем пустой объект
    const data = {};

    // Производим глубокое копирование всех массивов координат
    // чтобы не ссылаться на исходники
    // и заносим в пустой объект
    data.bottomOut = JSON.parse(JSON.stringify(bottomOut));
    data.bottomIn = JSON.parse(JSON.stringify(bottomIn));
    data.topOut = JSON.parse(JSON.stringify(topOut));
    data.topIn = JSON.parse(JSON.stringify(topIn));
    data.leftOut = JSON.parse(JSON.stringify(leftOut));
    data.leftIn = JSON.parse(JSON.stringify(leftIn));
    data.rightOut = JSON.parse(JSON.stringify(rightOut));
    data.rightIn = JSON.parse(JSON.stringify(rightIn));
    data.centerOut = JSON.parse(JSON.stringify(centerOut));
    data.centerIn = JSON.parse(JSON.stringify(centerIn));

    // Создаем экземпляр класса, и передаем объект с координатами
    let shuriken = new Drawing(data, posX, posY);

    // Возвращаем экземпляр класса
    return shuriken;
};
